Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
typedef enum
{
    ADV_PROC_START_CONNECT,
    ADV_PROC_STOP_ADV,
    ADV_PROC_CONNECT,
}advProcEvT;

typedef enum
{
    DEV_SCANNING,
    DEV_CONNECTION,
}connPhase;

typedef enum
{
    ADV_IDLE,              // Mo advertising
    ADV_GENERAL,           // after power on without bonds OR after erase all bonds
    ADV_ADD_NEW,           // after press connect pushbutton
    ADV_RECONNECT_SCAN,    // after power on with bonds    OR after disconnect
    ADV_RECONNECT_CONNECT,
}advTypeT;

struct
{
    connPhase phase;
    uint16_t  listDetectedDev[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint8_t   quantityDetectedDev;
    uint8_t   connectCnt;
    uint8_t   loopCnt;
}advDirOrdConnState;

advTypeT currentAdv = ADV_IDLE;



/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(uint16_t intervalMSeconds, uint16_t periodSeconds, bool whitelistEnabled)
{
    ret_code_t err_code;
    uint8_t    adv_flags;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = adv_flags;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_on_disconnect_disabled = false;
    init.config.ble_adv_whitelist_enabled      = whitelistEnabled;
    init.config.ble_adv_directed_enabled       = false;
    init.config.ble_adv_directed_slow_enabled  = false;
    init.config.ble_adv_directed_slow_interval = APP_ADV_FAST_INTERVAL;
    init.config.ble_adv_directed_slow_timeout  = APP_ADV_FAST_TIMEOUT;
    init.config.ble_adv_fast_enabled           = true;
    init.config.ble_adv_fast_interval          = intervalMSeconds;
    init.config.ble_adv_fast_timeout           = periodSeconds;
    init.config.ble_adv_slow_enabled           = false;
    init.config.ble_adv_slow_interval          = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout           = APP_ADV_SLOW_TIMEOUT;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


bool peerIdInList(pm_peer_id_t peerIdIn)
{
    pm_peer_id_t peer_id;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    while (peer_id != PM_PEER_ID_INVALID )
    {
        if( peerIdIn == peer_id)
        {
            return true;
        }
        peer_id = pm_next_peer_id_get(peer_id);
    }
    return false;
}


/**@brief Function for starting advertising. ADV_RECONNECT_SCAN
 */
static void advertisingApStart(advTypeT advType, uint16_t peerId)
{
    ret_code_t ret;
    if(currentAdv != ADV_IDLE)
    {
        sd_ble_gap_adv_stop();
    }
    switch(advType)
    {
    case ADV_GENERAL:
        NRF_LOG_INFO("ADV General");
        m_whitelist_peer_cnt = 0;
        // set timeout and period of advertising
        advertising_init(APP_ADV_FAST_SEARCH_INTERVAL, APP_ADV_FAST_SEARCH_TIMEOUT, false);
        // scanning without white list
        currentAdv = ADV_GENERAL;
        break;
    case ADV_ADD_NEW:
        NRF_LOG_INFO("ADV add new");
        m_whitelist_peer_cnt = 0;
        // set timeout and period of advertising
        advertising_init(APP_ADV_FAST_SEARCH_INTERVAL, APP_ADV_FAST_SEARCH_TIMEOUT, false);
        // scanning without white list, but REJECT connection all current peers
        currentAdv = ADV_ADD_NEW;
        break;
    case ADV_RECONNECT_SCAN:

        // set white list parameters
        memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
        m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));
        peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

        NRF_LOG_INFO("Adv recon: %d", m_whitelist_peer_cnt);


        if(m_whitelist_peer_cnt == 0) // if no peer devices -
        {
            // set timeout and period of advertising
            advertising_init(APP_ADV_FAST_SEARCH_INTERVAL, APP_ADV_FAST_SEARCH_TIMEOUT, true);
            currentAdv = ADV_GENERAL;
        }
        else
        {
             // set timeout and period of advertising
            advertising_init(APP_ADV_FAST_SCANING_INTERVAL, APP_ADV_FAST_SCANING_TIMEOUT, true);
            currentAdv = ADV_RECONNECT_SCAN;
            timerRun(stopScanAdvTimerCallback, 4000);
        }
        //m_whitelist_peer_cnt = 0;
        break;
    case ADV_RECONNECT_CONNECT:
        // set timeout and period of advertising
        advertising_init(APP_ADV_FAST_CONNECT_INTERVAL, APP_ADV_FAST_CONNECT_TIMEOUT, false);
        // set white list parameters
        NRF_LOG_INFO("Adv recon conn");
        m_whitelist_peers[0] = peerId;
        m_whitelist_peer_cnt = 1;

        currentAdv = ADV_RECONNECT_SCAN;
        break;
    default:
        break;
    }
    //NRF_LOG_INFO("Config Ok");
    ret = pm_whitelist_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                           (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
    APP_ERROR_CHECK(ret);
    // Setup the device identies list.
    // Some SoftDevices do not support this feature.
    ret = pm_device_identities_list_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                        (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));

    if (ret != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(ret);
    }
    NRF_LOG_INFO("------start adv1-------");
    advState = true;
    ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(ret);
}


void advertisingAddNew(advProcEvT inEv, uint16_t connHandle, pm_peer_id_t peerId)
{
    ret_code_t err_code;
    if(!peerIdInList(peerId))
    {
        NRF_LOG_INFO("No device on the list");
        return;
    }
    NRF_LOG_INFO("Disconnect old dev");
    err_code = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }
}



void advertisingDirectProc(advProcEvT inEv, uint16_t connHandle, pm_peer_id_t peerId)
{
    ret_code_t err_code;
    switch(inEv)
    {
    case ADV_PROC_START_CONNECT: // 1
        NRF_LOG_INFO("CONNECT");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING:  // add device to the list of device that was detected
        {
            uint8_t pos;
            // disconnect input connection
            NRF_LOG_INFO("_SCANNING_");
            err_code = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            if(orderGetPos(deviceOrder, peerId, &pos))
            {
                // save scanning peer ID
                if(advDirOrdConnState.listDetectedDev[pos] == DETECTED_DEV_FREE)
                {
                    advDirOrdConnState.listDetectedDev[pos] = peerId;
                    advDirOrdConnState.quantityDetectedDev++;
                }
            }

