Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
        }
        break;
        case DEV_CONNECTION:// DO NOTHING (continue connection processing)
            NRF_LOG_INFO("_CONNECTION_");
            break;
        }
        break;
    case ADV_PROC_STOP_ADV:
        NRF_LOG_INFO("STOP_ADV");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING: // start connection to detected devices
        {
            uint8_t cnt_1 = 0;
            uint8_t cnt_2 = 0;
            NRF_LOG_INFO("_SCANNING_");
            for(cnt_1 = 0; cnt_1 < BLE_GAP_WHITELIST_ADDR_MAX_COUNT - 1; cnt_1++)
            {
                for(cnt_2 = BLE_GAP_WHITELIST_ADDR_MAX_COUNT-1; cnt_2 > 0; cnt_2--)
                {
                    if(advDirOrdConnState.listDetectedDev[cnt_2 - 1] == DETECTED_DEV_FREE &&
                            advDirOrdConnState.listDetectedDev[cnt_2 ]    != DETECTED_DEV_FREE)
                    {
                        advDirOrdConnState.listDetectedDev[cnt_2 - 1] = advDirOrdConnState.listDetectedDev[cnt_2 ];
                        advDirOrdConnState.listDetectedDev[cnt_2 ]    = DETECTED_DEV_FREE;
                    }
                }
            }
            NRF_LOG_INFO("Find %d", advDirOrdConnState.quantityDetectedDev);
            advDirOrdConnState.connectCnt = 0;
            advertisingApStart(ADV_RECONNECT_CONNECT , advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
        }
        break;
        case DEV_CONNECTION:   //  continue connection to next device
            NRF_LOG_INFO("_CONNECTION_");
            if(advDirOrdConnState.connectCnt >= advDirOrdConnState.quantityDetectedDev)
            {

                advDirOrdConnState.loopCnt++;

                if(advDirOrdConnState.loopCnt >= DIRECT_CONN_QUANTITY)
                {
                    // start general advertising
                    break;
                }
                // start scanning
                memset(advDirOrdConnState.listDetectedDev, DETECTED_DEV_FREE, sizeof(advDirOrdConnState.listDetectedDev));
                advDirOrdConnState.connectCnt = 0;
                advDirOrdConnState.phase      = DEV_SCANNING;
                advertisingApStart(ADV_RECONNECT_SCAN, 0);
            }
            // shift to next detected device
            advDirOrdConnState.connectCnt++;
            advertisingApStart(ADV_RECONNECT_CONNECT, advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
            break;
        }
        break;
    default:
        break;
    }
}


void advertisingProcessing(advProcEvT inEv, uint16_t connHandle, pm_peer_id_t peerId)
{
    switch(currentAdv)
    {
    case ADV_GENERAL:
        NRF_LOG_INFO("ADV_GENERAL");
        break;
    case ADV_ADD_NEW:
        NRF_LOG_INFO("ADV_ADD_NEW");
        advertisingAddNew(inEv, connHandle, peerId);
        break;
    case ADV_RECONNECT_SCAN:
        NRF_LOG_INFO("ADV_SCAN");
        advertisingDirectProc(inEv, connHandle, peerId);
        break;
    case ADV_RECONNECT_CONNECT:
        NRF_LOG_INFO("ADV_CONNECT");
        advertisingDirectProc(inEv, connHandle, peerId);
        break;
    default:
        break;
    }
}


void advScanStop(void)
{
    NRF_LOG_INFO("Stop Scan");
    advState   = false;
    timerRun(switchToConnAdvTimerCallback, 500);
}


void switchToConnAdv(void)
{
    NRF_LOG_INFO("switch To conn");
    currentAdv = ADV_IDLE;
    advertisingProcessing(ADV_PROC_STOP_ADV, 0, 0);
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    ret_code_t err_code;
    uint8_t  battery_level;

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_FORBIDDEN) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

